case_light/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
    format ascii;
    class volVectorField;
    object U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -1 0 0 0 0];

internalField uniform (1 0 0);

boundaryField {
    inlet {
        type fixedValue;
        value uniform (1 0 0);
    }

    outlet {
        type zeroGradient;
    }

    y_max {
        type slip;
    }

    y_min {
        type slip;
    }

    z_max {
        type slip;
    }

    z_min {
        type slip;
    }

    cylinder {
        type noSlip;
    }

}

// ************************************************************************* //