case_light/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
    format ascii;
    class volScalarField;
    location "0";
    object epsilon;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -3 0 0 0 0];

internalField uniform 0.0337;

boundaryField {
    inlet {
        type turbulentMixingLengthDissipationRateInlet;
        mixingLength 0.14;
        value $internalField;
    }

    outlet {
        type zeroGradient;
    }

    y_max {
        type turbulentMixingLengthDissipationRateInlet;
        mixingLength 0.14;
        value $internalField;
    }

    y_min {
        type turbulentMixingLengthDissipationRateInlet;
        mixingLength 0.14;
        value $internalField;
    }

    z_max {
        type turbulentMixingLengthDissipationRateInlet;
        mixingLength 0.14;
        value $internalField;
    }

    z_min {
        type turbulentMixingLengthDissipationRateInlet;
        mixingLength 0.14;
        value $internalField;
    }

    cylinder {
        type epsilonWallFunction;
        value $internalField;
    }
}


// ************************************************************************* //