case_light/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
    format ascii;
    class volScalarField;
    location "0";
    object k;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0.0938;

boundaryField {
    inlet {
        type turbulentIntensityKineticEnergyInlet;
        intensity 0.05;
        value $internalField;
    }

    outlet {
        type zeroGradient;
    }

    y_max {
        type turbulentIntensityKineticEnergyInlet;
        intensity 0.05;
        value $internalField;
    }

    y_min {
        type turbulentIntensityKineticEnergyInlet;
        intensity 0.05;
        value $internalField;
    }

    z_max {
        type turbulentIntensityKineticEnergyInlet;
        intensity 0.05;
        value $internalField;
    }

    z_min {
        type turbulentIntensityKineticEnergyInlet;
        intensity 0.05;
        value $internalField;
    }

    cylinder {
        type kqRWallFunction;
        value $internalField;
    }

}


// ************************************************************************* //