case_light/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class volScalarField;
    location "0";
    object nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -1 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type calculated;
        value $internalField;
    }
    outlet
    {
        type calculated;
        value $internalField;
    }
    y_max
    {
        type calculated;
        value $internalField;
    }
    y_min
    {
        type calculated;
        value $internalField;
    }
    z_max
    {
        type calculated;
        value $internalField;
    }
    z_min
    {
        type calculated;
        value $internalField;
    }
    cylinder
    {
        type nutkWallFunction;
        value $internalField;
    }
}

// ************************************************************************* //
