case_light/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          640;
        startFace       899991;
    }
    outlet
    {
        type            patch;
        nFaces          640;
        startFace       900631;
    }
    y_max
    {
        type            patch;
        nFaces          14890;
        startFace       901271;
    }
    y_min
    {
        type            patch;
        nFaces          14890;
        startFace       916161;
    }
    z_max
    {
        type            patch;
        nFaces          1120;
        startFace       931051;
    }
    z_min
    {
        type            patch;
        nFaces          1120;
        startFace       932171;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8704;
        startFace       933291;
    }
)

// ************************************************************************* //
